### PANDAS DATAFRAMES

#### 1.How to create a table (dataframe)

In [3]:
# 1. import the necessary library
import pandas as pd

In [4]:
# how to initialize an empty dataframe(table)
df = pd.DataFrame()
df

Empty DataFrame
Columns: []
Index: []

#### 2How to create a dataframe from a list(s)

In [6]:
A_list = [142,124,162,106,137,168]

In [7]:
df_1 = pd.DataFrame(A_list)
df_1

     0
0  142
1  124
2  162
3  106
4  137
5  168

#### Add a column label to a dataframe

In [9]:
df_2 = pd.DataFrame(A_list,columns=["Total"])
df_2

   Total
0    142
1    124
2    162
3    106
4    137
5    168

In [10]:
#creating a list of lists.
students = [
           ["Victor",25,"Single","Male"],
           ["Martin",26,"Married","Male"],
           ["Linda",19,"Married","Female"]
           ]
students_df = pd.DataFrame(students,columns=["First Name","Age","Marital Status","Gender"])
students_df

  First Name  Age Marital Status  Gender
0     Victor   25         Single    Male
1     Martin   26        Married    Male
2      Linda   19        Married  Female

#### How to retrieve a column from a database

In [12]:
#this will produce a series object.a series doesnt have column headers.
students_df["Age"]

0    25
1    26
2    19
Name: Age, dtype: int64

#### How to retrieve multiple columns from a database

In [14]:
students_df[["Age","Gender"]]

   Age  Gender
0   25    Male
1   26    Male
2   19  Female

#### How to retrieve the table headers/column names

In [16]:
students_df.columns

Index(['First Name', 'Age', 'Marital Status', 'Gender'], dtype='object')

In [17]:
new_column_names = ["Name","How Old?","Married","Sex"]
students_df.columns = new_column_names
students_df

     Name  How Old?  Married     Sex
0  Victor        25   Single    Male
1  Martin        26  Married    Male
2   Linda        19  Married  Female

In [18]:
#How to change a column name eg how old?
new_column_names = ["Name","Age","Married","Sex"]
students_df.columns = new_column_names
students_df

     Name  Age  Married     Sex
0  Victor   25   Single    Male
1  Martin   26  Married    Male
2   Linda   19  Married  Female

In [19]:
# Create a list
linda = ["Linda",19,"Married","Female"]

In [20]:
#Replace an item in a list
linda[1] = 34
linda

['Linda', 34, 'Married', 'Female']

In [21]:
#insert a record in a specific position in a list object
linda.insert(2,"Banker")
linda

['Linda', 34, 'Banker', 'Married', 'Female']

In [22]:
linda.insert(-1,"Banker")
linda

['Linda', 34, 'Banker', 'Married', 'Banker', 'Female']

#### Read the first two rows

In [24]:
# method 1
students_df.head(2)

     Name  Age  Married   Sex
0  Victor   25   Single  Male
1  Martin   26  Married  Male

### Read the last two rows

In [26]:
students_df.tail(2)

     Name  Age  Married     Sex
1  Martin   26  Married    Male
2   Linda   19  Married  Female

**by default .head() and .tail() without specifying the actual number of rows returns 5 rows**

In [28]:
#method 2 : Using index positioning
#retrieves first 3 rows
students_df[:3]

     Name  Age  Married     Sex
0  Victor   25   Single    Male
1  Martin   26  Married    Male
2   Linda   19  Married  Female

In [29]:
# retrieve the last two rows
students_df[-2:]

     Name  Age  Married     Sex
1  Martin   26  Married    Male
2   Linda   19  Married  Female

In [30]:
#retrieving first two columns
students_df.iloc[:,:2]

     Name  Age
0  Victor   25
1  Martin   26
2   Linda   19

In [73]:
#retrieve first two rows and two columns
students_df.iloc[:2,:2]

     Name  Age
0  Victor   25
1  Martin   26

#### Dictionaries
Dictionaries are key value pairs

**How to create a dictionary**

In [34]:
#removed duplicate values by using data structure set which returns unique values.
unique_linda = set(linda)
unique_linda

{34, 'Banker', 'Female', 'Linda', 'Married'}

In [35]:
type(unique_linda)

set

In [36]:
linda_dictionary = {"age":19,"Occupation": "Banker","Gender":"Female","Name":"Linda","Marital status":"Married"}
linda_dictionary

{'age': 19,
 'Occupation': 'Banker',
 'Gender': 'Female',
 'Name': 'Linda',
 'Marital status': 'Married'}

In [37]:
type(linda_dictionary)

dict

In [38]:
#creating a list of dictionaries.
students_dict = [
                {
                'Name': 'Linda',
                'age': 19,
                'Marital status': 'Married',
                'Gender': 'Female',
                },   
                {
                'Name': 'Martin',
                'age': 26,
                'Marital status': 'Married',
                'Gender': 'Male',
                },
                {
                'Name': 'Linda',
                'age': 19,
                'Marital status': 'Married',
                'Gender': 'Female',
                } 
                
]
students_dict

[{'Name': 'Linda', 'age': 19, 'Marital status': 'Married', 'Gender': 'Female'},
 {'Name': 'Martin', 'age': 26, 'Marital status': 'Married', 'Gender': 'Male'},
 {'Name': 'Linda', 'age': 19, 'Marital status': 'Married', 'Gender': 'Female'}]

In [39]:
type(students_dict)

list